# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args:bash :session *pollen-bash*
#+PROPERTY: header-args:R :session *pollen-r*
#+LATEX_HEADER: \usepackage{longtable}
#+TITLE: 171002 Reanalysis with Index Reads


* Getting the raw data
MiSeq output is stored on the ~isilon~ server, which you can access from ~biocluster~, using the path ~/isilon/biodiversity/data/raw/illumina/AAFC/~. You can see a list of all data directories using the following code:

#+BEGIN_SRC bash
  ## List all output directories:
  rsync biocluster:${ISILON}${RUN}*_Reanalyzed
#+END_SRC

#+RESULTS:
|                       |                                                                       |
| drwxrwxr-x          1 | 180 2017/10/24 06:49:01 171002_M01696_0108_000000000-AYT43_Reanalyzed |

Each MiSeq run has it's own directory, and the first six numbers in the directory name indicate the run date. i.e., if your run started on October 10, 2017, the output will be in a directory named ~171010_...~. 

After you locate the directory with your data, you can transfer it onto Emmet with the following code. If you changed the definition of ~$RUN~ above to the date of your run the following should work as is:

#+BEGIN_SRC bash
  cd ~/miseq
  rsync -r biocluster:${ISILON}${RUN}*_Reanalyzed/ ${RUN}/
  cd $RUN
#+END_SRC

#+RESULTS:

This will take a few minutes to run.

** Mystery Index
Now we need to figure out what the foreign index is doing at the top of the list for Index 2, ~TCTTTCCC~. 

#+BEGIN_SRC bash
  INDEX=TCTTTCCC
  # mkdir ~/miseq/${RUN}/undet
  # cp ~/miseq/${RUN}/Data/Intensities/BaseCalls/Undetermined* ~/miseq/${RUN}/undet
  cd ~/miseq/${RUN}/undet
  # gunzip Undetermined_S0_L001_I2_001.fastq.gz
  grep -c $INDEX Undetermined_S0_L001_I2_001.fastq
#+END_SRC

#+RESULTS:
|         |
| 3794087 |

This matches the number of hits reported in [[file:Data/Intensities/BaseCalls/Alignment/DemultiplexSummaryF1L1.txt][DemultiplexSummaryF1L1.txt]], so we've grabbed the right sequences. Pull them all out and extract the coordinates:

#+BEGIN_SRC bash :results silent
grep -B 1 -A 2 TCTTTCCC Undetermined_S0_L001_I2_001.fastq > mysteryIndex2.fastq
grep '@M01696' mysteryIndex2.fastq > mysteryClusters
#+END_SRC

~mysteryClusters~ now contains the headers for all the clusters with the mystery Index2. Next we check to see what the Index1 value is for each of these:

#+BEGIN_SRC bash :results silent
  gunzip Undetermined_S0_L001_II_001.fastq.gz
  cut -d' ' -f1 mysteryClusters > clusterList
  split -l 100 clusterList cList
  for i in $(ls cList*); do
      grep -A 3 -f $i Undetermined_S0_L001_I1_001.fastq > ${i}.match &
  done


  cat *match > index1Matches
  grep -v '^--$' index1Matches > index1Matches1
  mv index1Matches1 index1Matches
  awk 'NR == 2 || NR % 4 == 2' index1Matches > index1
  sort index1 | uniq -c | sort -h > index1.tab
#+END_SRC

#+BEGIN_SRC R
  mystery1 <- read.table("undet/index1.tab", as.is = TRUE)
  colnames(mystery1) <- c("counts", "sequence")
  mystery1m <- merge(indexRef, mystery1, by.x = "reverse",
                   by.y = "sequence", all.y = TRUE)

  goodMatches <- mystery1m[which(! is.na(mystery1m$name)), ]
  goodMatches <- goodMatches[order(goodMatches$counts, decreasing = TRUE), ]

  sum(goodMatches$counts)
  sum(mystery1m$counts)
#+END_SRC
** --derep_fulllength script
#+BEGIN_SRC bash :results verbatim
  if [ ! -d $OUT/derep ]
  then
      echo creating derep directory
      mkdir $OUT/derep
  fi

  echo
  echo Starting dereplication:
  date
  for file in `ls $OUT/joined/*trj.all.fq | xargs -l1 basename -s .trj.all.fq`
  do 
      ## some sample names have hyphens, need to replace these with
      ## underscores; hence the relabel pattern replacement

      vsearch --derep_fulllength $OUT/joined/$file.trj.all.fq \
            --uc $OUT/derep/$file.tr.uc --sizeout --quiet\
            --output $OUT/derep/$file.tr.dr.fq \
            --relabel sample=${file//-/_}XXX \
            --minuniquesize 2
  done

  echo
  echo Finished dereplication:
  date

  ## Aggregate the output into a single fasta file
  cat $OUT/derep/*.dr.fq > $OUT/derep/derep.tr.fasta
  ## strip off the counters added to each read name:
  sed 's/XXX[^;]*;/;/g' $OUT/derep/derep.tr.fasta > $OUT/derep/derepSamp.tr.fasta
  echo
  ls -lh --color=never $OUT/derep/derep*.fasta
#+END_SRC

#+RESULTS:
#+begin_example


Starting dereplication:
Tue Jan 16 16:37:43 EST 2018

Finished dereplication:
Tue Jan 16 16:39:00 EST 2018

-rw-rw-r-- 1 smithty lab 278M Jan 16 16:39 ANALYSIS/derep/derepSamp.tr.fasta
-rw-rw-r-- 1 smithty lab 284M Jan 16 16:39 ANALYSIS/derep/derep.tr.fasta
#+end_example
*** Searching by read
#+BEGIN_SRC bash :results verbatim
  if [ ! -d $OUT/search ]
  then
      echo creating search directory
      mkdir $OUT/search
  fi

  echo
  echo Starting global search:
  date
  db=/home/smithty/data/illumina/vp_all.fasta

  vsearch --usearch_global $OUT/derep/derep.fasta --db $db \
              --uc $OUT/search/derep.uc \
              --biomout $OUT/search/derep.biom \
              --notmatched $OUT/search/derep.unmatched \
              --maxaccepts 100 \
              --id 0.98 --quiet 2>/dev/null

  echo
  echo Ending global search:
  date

  echo
  ls -lh --color=never $OUT/search/derep.{biom,uc,unmatched}
#+END_SRC

#+RESULTS:
#+begin_example

> > > $ $
Starting global search:
Fri Aug 11 15:25:43 EDT 2017
$ $ > > > > > $ $
Ending global search:
Fri Aug 11 15:26:35 EDT 2017
$
-rwxrwxrwx 1 root root 2.5M Aug 11 15:26 vs170804/search/derep.biom
-rwxrwxrwx 1 root root  11M Aug 11 15:26 vs170804/search/derep.uc
-rwxrwxrwx 1 root root 9.4M Aug 11 15:26 vs170804/search/derep.unmatched
#+end_example

*** Searching by Sample
#+BEGIN_SRC bash :results verbatim
  if [ ! -d $OUT/search ]
  then
      echo creating joined directory
      mkdir $OUT/search
  fi

  echo
  echo Starting global search:
  date
  db=/home/smithty/data/illumina/vp_all.fasta

  vsearch --usearch_global $OUT/derep/derepSamp.fasta --db $db \
              --uc $OUT/search/derepS.uc \
              --biomout $OUT/search/derepS.biom \
              --notmatched $OUT/search/derepS.unmatched \
              --maxaccepts 100 \
              --id 0.98 --quiet 2>/dev/null

  echo
  echo Ending global search:
  date

  echo
  ls -lh --color=never $OUT/search/derepS.{biom,uc,unmatched}
#+END_SRC

#+RESULTS:
#+begin_example

> > > $ $
Starting global search:
Fri Aug 11 15:27:43 EDT 2017
$ $ > > > > > $ $
Ending global search:
Fri Aug 11 15:28:35 EDT 2017
$
-rwxrwxrwx 1 root root 241K Aug 11 15:28 vs170804/search/derepS.biom
-rwxrwxrwx 1 root root 9.8M Aug 11 15:28 vs170804/search/derepS.uc
-rwxrwxrwx 1 root root 9.3M Aug 11 15:28 vs170804/search/derepS.unmatched
#+end_example

